added kroki diagrams
